print(f"\n\n{'*' *20} A {'*' *20}\n")

prices = [57.08, 46.51, 97, 51, 1.76, 20, 25.08, 76, 23.34, 98.90,
	          70.01, 63, 39, 90.47, 29, 24, 42, 59.11, 45.78, 48.29,
	          8.53, 67, 95, 5.62, 11, 18.34, 13, 64.80, 78, 93, 88.08]
for i in prices:
    ruble, penny = int(i // 1), int(f"{i%1:.02f}"[2:])
    print(f"{ruble}руб {int(penny):02d}коп", end=",")

print(f'\n\n{"*" * 20} B {"*" * 20}\n')

# сортируем цены по возрастанию и сравниваем ID
print(f"ID original: {id(prices)} - {prices}")
prices.sort()
print(f"ID modified: {id(prices)} - {prices}")

print(f'\n\n{"*" * 20} C {"*" * 20}\n')

# новый список отсортированный по убыванию
prices = [57.08, 46.51, 97, 51, 1.76, 20, 25.08, 76, 23.34, 98.90,
	          70.01, 63, 39, 90.47, 29, 24, 42, 59.11, 45.78, 48.29,
	          8.53, 67, 95, 5.62, 11, 18.34, 13, 64.80, 78, 93, 88.08]
n_prices = sorted(prices)
print(n_prices[::-1])

print(f'\n\n{"*" * 20} D {"*" * 20}\n')

# цены пяти самых дорогих товаров по возрастанию
prices = [57.08, 46.51, 97, 51, 1.76, 20, 25.08, 76, 23.34, 98.90,
	          70.01, 63, 39, 90.47, 29, 24, 42, 59.11, 45.78, 48.29,
	          8.53, 67, 95, 5.62, 11, 18.34, 13, 64.80, 78, 93, 88.08]
print(f"{sorted(prices, reverse=True)})\n\n\n{sorted(prices)[-5:]}")